<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1cd249d819d5f78915710a9f31b7fd0e6171bc45f1d2387b78130a8608ce3840","plan_job_ref":"Job terraform plan #270 at https://github.com/suzutan/infra/actions/runs/22480416500","plan_out_hash":"08f747402bc99a8934581d9e375c28a515e92d60143d347422b6a62f1b21589f","plan_hash":"cdcff051e0fc8e865603545d9f68ca82894bcdabc5e98b39165a3f3a7ea81ba8","plan_text_format":"diff","version":"2.2.3","closed":true} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_zero_trust_tunnel_cloudflared_config.web_tunnel_config will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "web_tunnel_config" {
!~      config     = {
!~          ingress = [
!~              {
!~                  hostname       = "*.harvestasya.org" -> "nexus-mdm.harvestasya.org"
!~                  service        = "https://pomerium-proxy.pomerium.svc.cluster.local" -> "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
!~              {
+                   hostname       = "*.harvestasya.org"
+                   origin_request = {
+                       no_tls_verify = true
                    }
!~                  service        = "http_status:404" -> "https://pomerium-proxy.pomerium.svc.cluster.local"
                },
+               {
+                   service = "http_status:404"
                },
#                (4 unchanged elements hidden)
            ]
        }
!~      created_at = "2026-02-23T03:56:30Z" -> (known after apply)
        id         = "c1e6260a-e43b-4a32-a405-dbbd063cddb3"
!~      source     = "cloudflare" -> (known after apply)
!~      version    = 12 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform apply #172](https://github.com/suzutan/infra/actions/runs/22480484603)
<details><summary>Outputs</summary>

```hcl
archia_tunnel_id                          = "cd6f7222-15f6-40bc-a858-526e2890f20e"
archia_tunnel_token                       = (sensitive value)
github_actions_cf_access_client_id        = (sensitive value)
github_actions_cf_access_client_secret    = (sensitive value)
harvestasya_tunnel_token                  = (sensitive value)
obsidian_livesync_cf_access_client_id     = (sensitive value)
obsidian_livesync_cf_access_client_secret = (sensitive value)
oracle_tunnel_id                          = "411a294c-b51f-4b61-ba1f-fe7b916b37d8"
oracle_tunnel_token                       = (sensitive value)
vista_tunnel_id                           = "c410c2e1-484b-402c-bc86-05a01c922e46"
web_tunnel_id                             = "c1e6260a-e43b-4a32-a405-dbbd063cddb3"
web_tunnel_token                          = (sensitive value)
```
</details>